## To implement various data flow transformations that are commonly used in ETL processes.

# Extract

In [38]:
import pandas as pd
url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
df = pd.read_csv(url)

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [40]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Transform

In [41]:
# Handling Missing Values:
df['Age'].fillna(df['Age'].mean(), inplace=True)
df['Cabin'].fillna("Unknown", inplace=True)
df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)

C:\Users\kgadg\AppData\Local\Temp\ipykernel_9320\472381321.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True)
C:\Users\kgadg\AppData\Local\Temp\ipykernel_9320\472381321.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Cabin'].fillna("Unknown", inplace=True)
C:\Users\kgadg\AppData\Local\Temp\ipykernel_9320\472381321.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)

In [42]:
# Passengers who survived
survived_passengers = df[df['Survived'] == 1]
print(survived_passengers[['PassengerId', 'Survived']].head())

   PassengerId  Survived
1            2         1
2            3         1
3            4         1
8            9         1
9           10         1

In [43]:
# Create New Column Based on Condition
df['Fare_Category'] = df['Fare'].apply(lambda x: 'High' if x > 50 else 'Low')
print(df[['Fare', 'Fare_Category']].value_counts())

Fare     Fare_Category
8.0500   Low              43
13.0000  Low              42
7.8958   Low              38
7.7500   Low              34
26.0000  Low              31
                          ..
8.1125   Low               1
8.1375   Low               1
17.4000  Low               1
8.1583   Low               1
7.7292   Low               1
Name: count, Length: 248, dtype: int64

In [44]:
# Encoding
df['Sex'] = df['Sex'].map({'male': 0, 'female': 1})  
df['Survived'] = df['Survived'].map({0: 'No', 1: 'Yes'})

In [45]:
# Group by 'Pclass' and Sum 'Fare'
df_grouped = df.groupby('Pclass', as_index=False)['Fare'].sum()
print(df_grouped)

   Pclass        Fare
0       1  18177.4125
1       2   3801.8417
2       3   6714.6951

In [46]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_Category
0,1,No,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,Unknown,S,Low
1,2,Yes,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C,High
2,3,Yes,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,Unknown,S,Low
3,4,Yes,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S,High
4,5,No,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,Unknown,S,Low

# Load

In [47]:
df.to_csv("titanic_transformed.csv", index=False)
print("ETL process completed")

ETL process completed